inst1_txt = """
Catchballは、オンラインでキャッチボールを行うプログラムです。

今回はあなたの他にあと　2　名の参加者の方がおり、　3　名でプレイしていただきます。
ボールが回ってきたら、左上のプレイヤーに投げる時は左ボタンを、
右上のプレイヤーに投げる時は右ボタンを押してください。
1ブロックあたり30球で、全部で6ブロック行っていただきます。
"""

inst2_txt = """
注意点があります。
①ボールの動きが確実に止まってからボタンを押してください。
②ボールを受け取ったらすぐに投げてください。
"""

inst3_txt = """
準備ができたら「START」ボタンを押してください。他プレイヤーとの接続を開始します。
全プレイヤーの準備ができたらブロックを開始しますので、キーボードに指を置いてお待ちください。
できるだけ画面に集中し、頭を動かさないようにしてください。
"""

conn_txt = """
現在、他のプレイヤーと繋がっています。
ブロック開始するまでしばらくお待ちください。
"""

start_txt = """
練習ブロックが終了しました。
全プレイヤーの準備ができたら次ブロックを開始しますので、キーボードに指を置いてお待ちください。
お互いに、他の2人がどんな人か、いまどんな気持ちか想像しながら取り組んでください。

準備できたら「OK」ボタンを押してください。
"""

between_txt = """
ブロックが終了しました。
アンケートへの記入をお願いします。
回答が済んだら「START」ボタンを押してください。他プレイヤーとの接続を開始します。
全プレイヤーの準備ができたら次ブロックを開始しますので、キーボードに指を置いてお待ちください。
お互いに、他の2人がどんな人か、いまどんな気持ちか想像しながら取り組んでください。
"""

end_txt = """
6ブロックが終了しました。
アンケートへの記入をお願いします。
"""
